artillery/results-summary/Resultado test basic-load algoritmo bybussiness.txt
All VUs finished. Total time: 32 seconds

--------------------------------
Summary report
--------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 8
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 8
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.GET root: ............................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.1
  max: ......................................................................... 41.8
  mean: ........................................................................ 6.1
  median: ...................................................................... 5.1
  p95: ......................................................................... 8.8
  p99: ......................................................................... 29.1