artillery/results-summary/Resultado test basic-load algoritmo bytraffic.txt
All VUs finished. Total time: 32 seconds

--------------------------------
Summary report
--------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 6
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 6
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.GET root: ............................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.1
  max: ......................................................................... 33.2
  mean: ........................................................................ 5.8
  median: ...................................................................... 5
  p95: ......................................................................... 7.8
  p99: ......................................................................... 26.8