artillery/results-summary/Resultado test basic-load no balancer.txt
All VUs finished. Total time: 32 seconds

--------------------------------
Summary report
--------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 10
  mean: ........................................................................ 2.6
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 10
  mean: ........................................................................ 2.6
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.GET root: ............................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.2
  max: ......................................................................... 39.8
  mean: ........................................................................ 6.4
  median: ...................................................................... 5.3
  p95: ......................................................................... 10.7
  p99: ......................................................................... 34.8