artillery/results-summary/Resultado test ramp-up algoritmo bybussiness.txt
All VUs finished. Total time: 4 minutes, 1 second

--------------------------------
Summary report
--------------------------------

http.codes.200: ................................................................ 5700
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 28/sec
http.requests: ................................................................. 5700
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 535
  mean: ........................................................................ 4.5
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 7.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 535
  mean: ........................................................................ 4.5
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 7.9
http.responses: ................................................................ 5700
vusers.completed: .............................................................. 5700
vusers.created: ................................................................ 5700
vusers.created_by_name.Ramp up test: ........................................... 5700
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1003.2
  max: ......................................................................... 1553.1
  mean: ........................................................................ 1007
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1022.7