artillery/results-summary/Resultado test ramp-up algoritmo bytraffic.txt
All VUs finished. Total time: 4 minutes, 1 second

--------------------------------
Summary report
--------------------------------

http.codes.200: ................................................................ 5700
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 28/sec
http.requests: ................................................................. 5700
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 625
  mean: ........................................................................ 5.6
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 58.6
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 625
  mean: ........................................................................ 5.6
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 58.6
http.responses: ................................................................ 5700
vusers.completed: .............................................................. 5700
vusers.created: ................................................................ 5700
vusers.created_by_name.Ramp up test: ........................................... 5700
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1002.9
  max: ......................................................................... 1627.3
  mean: ........................................................................ 1008.1
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1064.4